#+title: Programming

Configuration for programming and languages support.

#+begin_src emacs-lisp
  ;;; -*- lexical-binding: t -*-
#+end_src

* Treesit

#+begin_src emacs-lisp
  (setq treesit-language-source-alist
        '((bash "https://github.com/tree-sitter/tree-sitter-bash")
          (cmake "https://github.com/uyha/tree-sitter-cmake")
          (css "https://github.com/tree-sitter/tree-sitter-css")
          (elisp "https://github.com/Wilfred/tree-sitter-elisp")
          (go "https://github.com/tree-sitter/tree-sitter-go")
          (html "https://github.com/tree-sitter/tree-sitter-html")
          (javascript "https://github.com/tree-sitter/tree-sitter-javascript" "master" "src")
          (json "https://github.com/tree-sitter/tree-sitter-json")
          (make "https://github.com/alemuller/tree-sitter-make")
          (markdown "https://github.com/ikatyang/tree-sitter-markdown")
          (python "https://github.com/tree-sitter/tree-sitter-python")
          (toml "https://github.com/tree-sitter/tree-sitter-toml")
          (tsx "https://github.com/tree-sitter/tree-sitter-typescript" "master" "tsx/src")
          (typescript "https://github.com/tree-sitter/tree-sitter-typescript" "master" "typescript/src")
          (yaml "https://github.com/ikatyang/tree-sitter-yaml")
          (clojure "https://github.com/sogaiu/tree-sitter-clojure")
          (rust "https://github.com/tree-sitter/tree-sitter-rust")))
#+end_src

#+RESULTS:
| bash       | https://github.com/tree-sitter/tree-sitter-bash       |        |                |
| cmake      | https://github.com/uyha/tree-sitter-cmake             |        |                |
| css        | https://github.com/tree-sitter/tree-sitter-css        |        |                |
| elisp      | https://github.com/Wilfred/tree-sitter-elisp          |        |                |
| go         | https://github.com/tree-sitter/tree-sitter-go         |        |                |
| html       | https://github.com/tree-sitter/tree-sitter-html       |        |                |
| javascript | https://github.com/tree-sitter/tree-sitter-javascript | master | src            |
| json       | https://github.com/tree-sitter/tree-sitter-json       |        |                |
| make       | https://github.com/alemuller/tree-sitter-make         |        |                |
| markdown   | https://github.com/ikatyang/tree-sitter-markdown      |        |                |
| python     | https://github.com/tree-sitter/tree-sitter-python     |        |                |
| toml       | https://github.com/tree-sitter/tree-sitter-toml       |        |                |
| tsx        | https://github.com/tree-sitter/tree-sitter-typescript | master | tsx/src        |
| typescript | https://github.com/tree-sitter/tree-sitter-typescript | master | typescript/src |
| yaml       | https://github.com/ikatyang/tree-sitter-yaml          |        |                |
| clojure    | https://github.com/sogaiu/tree-sitter-clojure         |        |                |
| rust       | https://github.com/tree-sitter/tree-sitter-rust       |        |                |

Lower font lock level

#+begin_src emacs-lisp
  (setq treesit-font-lock-level 2)
#+end_src

